import PropertyImg from "../assets/home.png";
import IndustryImg from "../assets/industries.png";
import InventoryImg from "../assets/inventory.png";
import FactoryImg from "../assets/factory.png";
import HotelsImg from "../assets/hotels.png";

export const fireFeatures = [
  "تغطية الحريق والصواعق",
  "تغطية الانفجار",
  "الأضرار الناتجة عن الدخان",
  "تغطية السطو",
];

export const fireSections = [
  {
    image: PropertyImg,
    title: " المنازل والفلل",
    paragraph:
      "حماية متكاملة للمنازل والفلل ضد أخطار الحريق والسرقة وتسربات المياه، مع تغطية للممتلكات لضمان راحة البال لك ولأسرتك.",
  },
  {
    image: IndustryImg,
    title: " المنشآت التجارية والصناعية",
    paragraph:
      "تغطية شاملة للمنشآت التجارية والصناعية ضد الحريق والأخطار المختلفة، تشمل المباني والمعدات والمخزون لضمان استمرارية الأعمال.",
  },
  {
    image: FactoryImg,
    title: "المصانع والورش",
    paragraph:
      "حماية مخصصة للمصانع والورش ضد المخاطر التشغيلية والحريق، مع تغطية للآلات والإنتاج لضمان تقليل التوقف والخسائر.",
  },
  {
    image: InventoryImg,
    title: " المخازن والمستودعات",
    paragraph:
      "تأمين شامل للمخازن والمستودعات ضد الحريق والسرقة والتلف، مع حماية البضائع المخزنة للحفاظ على قيمة الأصول.",
  },
  {
    image: HotelsImg,
    title: "الفنادق والمنشآت الخدمية",
    paragraph:
      "حلول تأمينية متكاملة للفنادق والمنشآت الخدمية تغطي الممتلكات والمسؤوليات، لضمان استمرارية الخدمة وثقة العملاء.",
  },
];
export const fireCarouselData = [
  {
    title: "تأمين الحريق",
    description:
      "تغطي وثيقة تأمين الحريق الخسائر أو الأضرار المادية التي قد تلحق بالممتلكات نتيجة أخطار الحريق وما يرتبط بها من حوادث مفاجئة.",
    features: [
      "الحريق العرضي",
      "الانفجار",
      "الصواعق (البرق)",
      "امتداد النيران من ممتلكات مجاورة",
    ],
    isCheck: true,
    checkColor: "text-green-600 font-bold",
    note: "يمكن توسيع التغطية بإضافة أخطار إضافية وفقًا لشروط الوثيقة.",
    noteClass: "bg-amber-50 border-amber-400 text-amber-800",
  },

  {
    title: "أهم الاستثناءات",
    description: "لا تغطي الوثيقة عادةً بعض الحالات والاستثناءات التالية:",
    features: [
      "الأضرار الناتجة عن الإهمال الجسيم أو التعمد",
      "التلف التدريجي أو البلى الطبيعي",
      "الخسائر غير المباشرة ما لم يتم الاتفاق عليها",
      "أخطار الحرب أو الكوارث النووية",
    ],
    note: "قد تختلف الاستثناءات حسب شروط الوثيقة ونوع التغطية المتفق عليها.",
    noteClass: "bg-red-50 border-red-400 text-red-800",
  },
  {
    title: "التغطيات الإضافية (اختيارية)",
    description:
      "تشمل هذه التغطية أخطارًا إضافية قد تسبب أضرارًا مادية للممتلكات وفقًا لشروط الوثيقة.",
    gridItems: [
      "العواصف والأمطار الغزيرة",
      "الزلازل والهزات الأرضية",
      "تسرب المياه من أنظمة الإطفاء",
      "الشغب والاضطرابات المدنية",
      "سقوط الطائرات أو أجزائها",
      "اصطدام المركبات بالمبنى",
      "انفجار أنابيب الغاز",
    ],
  },
];
